Repository: Mudoker/iOS_MasterChess_v2.0
Catalog: Master Chess/Utilities/Localization/*.lproj/Localizable.strings
Languages: vi

source: Settings
vi: Cài đặt

source: Newbie
vi: Nhập môn

source: Pro
vi: Cao Thủ

source: Master
vi: Kiện tướng

source: Grand Master
vi: Đại kiện tướng

source: Rating: %@
vi: Điểm: %@

source: New Username
vi: Tên đăng nhập mới

source: New Password
vi: Mật khẩu mới

source: Auto Promotion Enabled
vi: Tự động phong cấp

source: Music Enabled
vi: Bật nhạc

source: Sound Enabled
vi: Bật âm thanh

source: Theme
vi: Giao diện

source: Light
vi: Sáng

source: Dark
vi: Tối

source: System
vi: Hệ thống

source: Language
vi: Ngôn ngữ

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

source: Difficulty
vi: Độ khó

source: The AI will plan at most 2 moves ahead
vi: AI sẽ tính trước tối đa 2 bước

source: The AI will plan at most 3 moves ahead
vi: AI sẽ tính trước tối đa 3 bước

source: The AI will always plan 3 moves ahead
vi: AI sẽ tính trước tối thiểu 3 bước

source: %@ moves left
vi: Còn %@ lượt

source: %@'s Turn
vi: Lượt: %@

source: Start a move!
vi: Bắt đầu chơi!

source: New Game
vi: Game mới

source: Resign
vi: Đầu hàng

source: Main menu
vi: Trang chủ

source: Force Win
vi: Ép Thắng

source: Force Draw
vi: Ép Hoà

source: Force Lose
vi: Ép Thua

source: Overview of Chess Game
vi: Tổng quan về Cờ Vua

source: Chess is a classic two-player strategy board game that has been enjoyed for centuries. It's played on an 8x8 board called a chessboard, with each player having control over an army of 16 pieces. The objective is to checkmate the opponent's king while protecting your own.
vi: Cờ vua là một trò chơi chiến thuật hai người cổ điển đã được phổ biến suốt hàng thế kỷ. Cờ vua được chơi trên một bàn cờ 8x8 gọi là bàn cờ cờ vua, với mỗi người chơi sẽ kiểm soát một bộ gồm 16 quân cờ. Mục tiêu là chiếu hết (check mate) đối phương trong khi bảo vệ tướng của bạn.

source: Board Setup
vi: Thiết lập bàn cờ

source: The chessboard consists of 64 squares arranged in an 8x8 grid. Players sit in front of each other, with the board oriented so that each player has a white square on their right. Place the pieces on the board as follows:
vi: Bàn cờ vua bao gồm 64 ô được sắp xếp trong một ma trận 8x8. Người chơi sẽ ngồi đối diện nhau, với bàn cờ được căn chỉnh sao cho mỗi người chơi sẽ có một ô màu trắng ở bên phải của họ. Đặt các quân cờ lên bàn cờ như sau:

source: Each player has 16 pieces: 1 king, 1 queen, 2 rooks, 2 knights, 2 bishops, and 8 pawns.
vi: Mỗi người chơi có 16 quân cờ: 1 tượng, 1 hậu, 2 xe, 2 mã, 2 tượng, và 8 tốt.

source: Pawns occupy the second row (rank) for white and the seventh row for black.
vi: Quân tốt chiếm dòng thứ hai cho bên trắng và dòng thứ bảy cho bên đen.

source: Two rooks occupy the corners.
vi: Hai xe chiếm 2 góc trái phải của bàn cờ.

source: The two knights are next to the rooks.
vi: Hai mã được đặt bên cạnh hai xe.

source: The two bishops are placed next to the knights.
vi: Hai tượng được đặt bên cạnh hai mã.

source: The queen takes her place on the remaining square of her color.
vi: Hậu được đặt vào ô còn lại cùng màu của mình.

source: The king stands beside the queen.
vi: Vua đứng bên cạnh hậu.

source: How to move
vi: Cách di chuyển

source: Pawns move forward one square and capture diagonally.
vi: Tốt di chuyển về phía trước một ô và ăn quân theo đường chéo.

source: Rooks move horizontally or vertically across the board.
vi: Xe di chuyển ngang hoặc dọc trên bàn cờ.

source: Knights move in an L-shape: two squares in one direction and then one square perpendicular.
vi: Ngựa di chuyển theo hình chữ 'L': hai ô theo một hướng, sau đó một ô vuông vuông góc.

source: Bishops move diagonally.
vi: Tượng di chuyển theo đường chéo.

source: Queens can move horizontally, vertically, or diagonally.
vi: Hậu có thể di chuyển ngang, dọc hoặc theo đường chéo.

source: Kings move one square in any direction.
vi: Vua di chuyển một ô theo hướng bất kỳ.

source: How to win
vi: Cách chiến thắng

source: The game is won by putting the opponent's king in checkmate, in other words, the king is under attack and cannot escape. You can also win if your opponent resigns, runs out of time, or exceeds the number of moves.
vi: Trò chơi được thắng bằng cách đặt tướng đối phương vào tình trạng chiếu tướng, nghĩa là tướng đối phương đang bị tấn công và không thể thoát khỏi. Bạn cũng có thể thắng nếu đối thủ của bạn bỏ cuộc, hết thời gian, hoặc vượt quá số lượt đi.

source: Master Rank Constraints
vi: Độ khó cho bậc Kiện Tướng

source: If players are in the Master rank (rating > 1300), they will have a time limit of 10 minutes for the entire game. This adds urgency and encourages quick decision-making. They will also be limited to 40 moves in total. If they reach 0 moves, it will result in an immediate loss.
vi: Nếu người chơi ở bậc Kiện tướng (điểm > 1300), họ sẽ bị giới hạn thời gian giới hạn là 10 phút cho cả trận đấu. Điều này nhằm tăng độ khó và khuyến khích việc ra quyết định nhanh chóng. Họ cũng sẽ bị giới hạn 40 nước đi tổng cộng. Nếu vượt quá 40 bước sẽ bị xử thua ngay lập tức.

source: Grand Master Rank Constraints
vi: Độ khó cho bậc Đại Kiện Tướng

source: For those Grandmasters (rating > 1600), there's a limit on the number of moves (30 moves in total). Players must carefully plan their strategies as they're restricted in their available moves.
vi: Đối với những Đại Kiện Tướng (điểm >= 1600), sẽ có giới hạn về số lượng nước đi (tổng cộng 30 nước). Người chơi phải lập kế hoạch chiến thuật cẩn thận vì họ sẽ bị hạn chế trong tổng số nước đi có sẵn.

source: Score Calculation
vi: Cách tính điểm

source: In the game, points are awarded based on expected and final performance:
vi: Trong Master Chess, điểm được đánh giá dựa trên kết quả dự kiến và kết quả cuối cùng:

source: Where:
vi: Trong đó:

source: RatingChange = KFactor * DifficultyMultiplier * (ActualOutcome - ExpectedOutcome)
vi: Điểm chênh lệch = Hệ số K * Độ khó * (Kết quả Thực tế - Kết quả Dự kiến)

source: ExpectedOutcome = 1 / (1 + 10^((OpponentRating - PlayerRating) / 400))
vi: Kết quả Dự kiến = 1 / (1 + 10^((Điểm Đối thủ - Điểm Người chơi) / 400))

source: • RatingChange is the calculated change in the player's rating.
vi: • Điểm chênh lệch là sự thay đổi trong điểm đánh giá của người chơi.

source: • KFactor represents a constant that governs the sensitivity of rating changes.
vi: • Hệ số K đại diện cho một hằng số quy định sự thay đổi điểm đánh giá.

source: • DifficultyMultiplier adjusts the impact of difficulty levels on the rating change.
vi: • Sự thay đổi điểm sẽ dựa vào độ khó của game.

source: • ActualOutcome signifies the actual game outcome's impact on the rating change.
vi: • Kết quả Thực tế biểu thị tác động thực sự của kết quả trò chơi lên sự thay đổi của điểm.

source: • ExpectedOutcome predicts the likelihood of a player's victory based on Elo's probability estimation.
vi: • Kết quả Dự kiến dự đoán khả năng chiến thắng của người chơi dựa trên điểm Elo.

source: Win rate
vi: Tỉ lệ thắng

source: Ratings
vi: Điểm

source: Join date:
vi: Ngày tham gia:

source: Achievements
vi: Thành tựu

source: History
vi: Lịch sử đấu

source: Easy
vi: Dễ

source: Normal
vi: Trung bình

source: Hard
vi: Khó

source: Win
vi: Thắng

source: Draw
vi: Hoà

source: Loss
vi: Thua

source: Pro Player
vi: Cao Thủ

source: First time login!
vi: Hành trình mới!

source: Get's started
vi: Làm nóng người!

source: Game Lover
vi: Nghiện Game

source: Friend with AI
vi: Bạn Thân AI

source: The Challenger
vi: Kẻ Thách Đấu

source: AI Killer
vi: Sát Thủ AI

source: Good morning!
vi: Chào buổi sáng!

source: Good evening!
vi: Chào buổi tối!

source: Good afternoon!
vi: Chào buổi chiều!

source: Competitive
vi: Đối kháng

source: Player versus Computer
vi: Người đấu Máy

source: Play
vi: Chơi

source: How to play?
vi: Cách chơi

source: Explore
vi: Khám phá

source: Official Website
vi: Trang chủ

source: Recent Matches
vi: Lịch sử đấu

source: No available history
vi: Không có lịch sử

source: Step
vi: Bước

source: Skip
vi: Bỏ qua

source: Continue
vi: Tiếp tục

source: Sign in
vi: Đăng nhập

source: Invalid username
vi: Tên không hợp lệ

source: Close
vi: Đóng

source: Create a profile
vi: Tạo hồ sơ mới

source: The username should be atleast 5 characters
vi: Tên đăng nhập phải chứa ít nhất 5 kí tự

source: Password
vi: Mật khẩu

source: Username
vi: Tên đăng nhập

source: Theme preference
vi: Giao diện

source: Music
vi: Nhạc nền

source: SFX
vi: Hiệu ứng

source: Auto Promotion
vi: Tự phong cấp

source: Disabled
vi: Tắt

source: Enabled
vi: Mở

source: 𝗟𝗼𝗴𝗶𝗻
vi: Đăng Nhập

source: Please sign in to continue
vi: Vui lòng đăng nhập để tiếp tục

source: Account
vi: Tài khoản

source: Username or email
vi: Tên đăng nhập hoặc email

source: (Optional)
vi: (Nếu có)

source: Login Successfully!
vi: Đăng nhập thành công!

source: Wrong username or password
vi: Sai tên đăng nhập/mật khẩu

source: Login
vi: Đăng nhập

source: Forgot password?
vi: Quên mật khẩu?

source: or
vi: hoặc

source: Create an account
vi: Tạo tài khoản

source: System alert
vi: Thông báo

source: Please try again
vi: Hãy thử lại

source: Password Recovery
vi: Lấy lại mật khẩu

source: Contact technical support
vi: Hỗ trợ kĩ thuật

source: Let's explore
vi: Khám phá nào

source: Need help?
vi: Trợ giúp?

source: Technical Support
vi: Hỗ trợ kĩ thuật

source: Please contact: s3927776@rmit.edu.vn
vi: Liên lạc: s3927776@rmit.edu.vn

source: Dashboard
vi: Trang chủ

source: Profile
vi: Hồ sơ

source: Confirm Change
vi: Xác nhận

source: Username Taken
vi: Tên đăng nhập đã tồn tại

source: The selected username is already taken. Please choose a different username.
vi: TTên đăng nhập đã tồn tại. Vui lòng chọn tên khác.

source: Sign out
vi: Đăng xuất

source: Confirmation
vi: Xác nhận

source: Are you sure you want to sign out?
vi: Bạn có chắc muốn đăng xuất?

source: Cancel
vi: Huỷ

source: Top 1 on the leaderboard!
vi: Top 1 bảng xếp hạng!

source: Top 2 on the leaderboard!
vi: Top 2 bảng xếp hạng!

source: Top 3 on the leaderboard!
vi: Top 3 bảng xếp hạng!

source: Play 1 game!
vi: Chơi 1 game!

source: Play 5 game!
vi: Chơi 5 game!

source: Play 10 game!
vi: Chơi 10 game!

source: Play 20 game!
vi: Chơi 20 game!

source: Play 50 game!
vi: Chơi 50 game!

source: Reach Newbie ranking
vi: Đạt Nhập Môn

source: Reach Pro ranking
vi: Đạt Cao Thủ

source: Reach Master ranking
vi: Đạt Kiện Tướng

source: Reach Grand Master ranking
vi: Đạt Đại Kiện Tướng

source: No available achievement
vi: Chưa có thành tựu

source: First Step
vi: Chập chững

source: Show All
vi: Tất cả

source: Show Less
vi: Thu gọn

source: Achievement Unlocked
vi: Mở khoá thành tựu

source: DRAW
vi: HOÀ

source: YOU WON
vi: THẮNG

source: Checkmate
vi: Chiếu bí

source: YOU LOSS
vi: Thua

source: Insufficient Material
vi: Thiếu quân

source: Stale Mate
vi: Thế bí

source: Out of move
vi: Hết lượt

source: Out of time
vi: Hết giờ

source: Current Rating
vi: Điểm hiện tại

source: Go Back
vi: Quay lại
